---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.HasInsulation
source: html/1f7a7f02-3754-6b2f-4639-407b5b95c21a.htm
---
# Autodesk.Revit.DB.FabricationPart.HasInsulation Property

True if the fabrication part is insulated.

## Syntax (C#)
```csharp
public bool HasInsulation { get; }
```